LookApp/app/views/apps/cart.html.erb

		<th>Total</th>
		<td>App.sum(:price)</td>
---
SELECT "apps".* FROM "apps"
SELECT SUM("apps"."price") FROM "apps"