LookApp/app/views/apps/index.html.erb


    <% App.all.order("id desc").limit(5).each do |app| %>
---
SELECT "apps".* FROM "apps" WHERE (name like '%mermaid%')  ORDER BY created_at DESC


     <% App.where(:suggested => "true").each do |app| %>
---
SELECT "apps".* FROM "apps" WHERE "apps"."suggested" = ?  [["suggested", "true"]]

    <tr>
      <% App.where(:featured => "true").each do |app| %>
---
SELECT "apps".* FROM "apps" WHERE "apps"."featured" = ?  [["featured", "t"]]