LookApp/app/views/apps/show.html.erb

      <h2>Comments</h2>
      <% @app.ratings.each do |rating| %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."app_id" = ?  [["app_id", 18]]