LookApp/app/controllers/apps_controller.rb

	def index
		@apps = App.all
---
SELECT "apps".* FROM "apps" WHERE (name like '%mermaid%')  ORDER BY created_at DESC

	def show
		@app = App.find(params[:id])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@app = App.find(params[:id])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]

	def cart
		@apps = App.all
---
SELECT "apps".* FROM "apps"

	def create
		@app = App.new(app_params)

		if @app.save
---
INSERT INTO "apps" ("appID", "name", "developer", "platform", "version", "price", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@app = App.find(params[:id])

		if @app.update(app_params)
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "apps" SET "developer" = ?, "platform" = ?, "price" = ?, "link" = ?, "updated_at" = ? WHERE "apps"."id" = ?  [["developer", "Snapchat, Inc"], ["platform", "Apple"], ["price", "0"], ["link", "snapchat.com"], ["updated_at", "2015-10-29 13:22:35.604330"], ["id", 2]]

	def destroy
		@app = App.find(params[:id])
		@app.destroy
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "apps" WHERE "apps"."id" = ?  [["id", 1]]