LookApp/app/controllers/apps_controller.rb

	def search
		if params[:search]
			@apps = App.search(params[:search]).order("created_at DESC")
---
SELECT "apps".* FROM "apps" WHERE (name like '%goat%')  ORDER BY created_at DESC