LookApp/app/controllers/ratings_controller.rb

SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "ratings" ("comment", "app_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "I tried"], ["app_id", 21], ["created_at", "2015-11-30 22:45:47.102738"], ["updated_at", "2015-11-30 22:45:47.102738"]]
---
	def create
		@app = App.find(params[:app_id])
		@rating = @app.ratings.create(rating_params)